# レイアウト規範

当社では ICCookbook のために基本的な作成フォーマットを設定しました。作成時には、以下のフォーマットに従って記事を作成するようお願いいたします。

## 1. 改行

タイトルの前には空行を入れる必要があります。つまり、前の部分の内容を書き終わったら、改行してからタイトルを書いてください。

## 2. スペース

### 2.1 日本語と英語の間にはスペースを入れる必要があります

正しい例：

LeanCloud では、データストレージは AVObject を中心に行われています。

誤った例：

LeanCloud ではAVObject を中心にデータストレージが行われます。

LeanCloudではAVObjectを中心にデータストレージが行われます。

完全な正しい使用法：

LeanCloud では、データストレージは AVObject を中心に行われています。各 AVObject は、JSON に準拠した key-value に対応するデータを含んでいます。データはスキーマフリーであり、AVObject ごとに事前にどのキーが存在するかを指定する必要はありません。対応する key-value を直接設定するだけで済みます。

例外：製品名は公式で定義されたフォーマットに従って書くことができます。

### 2.2 日本語と数字の間にはスペースを入れる必要があります

正しい例：

今日は買い物に出て、5000 元かかった。

誤った例：

今日は買い物に出て、5000元かかった。

### 2.3 数字と単位の間にはスペースを入れる必要があります

正しい例：

私の家の光ファイバー入り口は 10 Gbps で、SSD の合計容量は 20 TB です。

誤った例：

私の家の光ファイバー入り口は 10Gbps で、SSD の合計容量は 20TB です。

例外：度/パーセントと数字の間にはスペースを入れないでください：

正しい例：

今日は 233° の高温です。

新しい MacBook Pro は、CPU パフォーマンスが 15％ 向上しました。

誤った例：

今日は 233 ° の高温です。

新しい MacBook Pro は、CPU パフォーマンスが 15 % 向上しました。

### 2.4 全角の句読点と他の文字との間にはスペースを入れないでください。

### 2.5 引用符の周りにはスペースを入れてください。

正しい例：

100 個の整数型の変数を定義したい場合、どのように定義しますか？ "int a、b、c、d、e、f、g ..." ステートメントでは、26 個の文字だけでは足りません。 "int aa、bb、cc、dd …;" このように定義し続けると、これらの100個の整数型変数を定義するために何行のコードを入力する必要がありますか？ したがって、100個以上の整数型変数（または他の型の変数）を定義する問題を解決するために、「配列」を導入しました。
ダブルクォーテーション " の前後にスペースを入れて、目立たせます。

### コードの数字と記号の間にはスペースを入れてください。

```c++
for(i = 0; i <= 9; i++) {
    a[i] = i;
}
```

## 3. 句読点

### 3.1 句読点の重複は避けてください

正しい例：

ドイツチームがブラジルチームに勝った！

彼女があなたに「ニャー」と言った？！

誤った例：

ドイツチームがブラジルチームに勝った！！

ドイツチームがブラジルチームに勝った！！！！！！！！

彼女があなたに「ニャー」と言った？？！！

彼女があなたに「ニャー」と言った？！？！？？！！

### 3.2 全角と半角

全角と半角は文字の2つの表示形式で、全角は文字の縦横比が1対1の正方形であり、半角は全角の半分の幅の文字です。これらの用語は現在、コンピュータの表示される文字を指すために一般的に使用されます。

### 3.3 全角の中国語句読点を使用する

正しい例：

こんにちは！知っていますか？今日、フロントの女の子が私に「にゃん」と言ったんです！

核磁気共鳴イメージング（NMRI）の原理を知りたいですか？JFGI！

間違った例：

こんにちは!知っていますか?今日、フロントの女の子が私に「にゃん」と言ったんです！

こんにちは！知っていますか？今日、フロントの女の子が私に「にゃん」と言ったんです！

核磁気共鳴イメージング（NMRI）の原理を知りたいですか？JFGI!

核磁気共鳴イメージング(NMRI)の原理を知りたいですか?JFGI！

### 3.4 数字は半角文字を使用する

正しい例：

このケーキは1000円です。

間違った例：

このケーキは１０００円です。
例外：デザインの原稿や広告ポスターなど、極少量の数字が揃う場合には、文字の整列を容易にするために全角数字を使用することができます。

### 3.5 英語の完全な文や特殊名詞がある場合は、内容は半角の句読点を使用する

正しい例：

ジョブズはどう言ったか？ 「Stay hungry, stay foolish.」

あなたには、『Hackers & Painters: Big Ideas from the Computer Age』を読むことをお勧めします。とても面白いです。

間違った例：

句点を間違えた例：ジョブズはどう言ったか？ 「Stay hungry，stay foolish。」

コロンを間違えた例：あなたには、『Hackers＆Painters：Big Ideas from the Computer Age』を読むことをお勧めします。とても面白いです。

## 4. 名詞

### 4.1 固有名詞は適切な大文字小文字を使用する

大文字小文字の使い方は、英語の書き方に属するもので、この wiki の議論内容には含まれていません。ここでは、一部の間違いやすい使い方について説明します。

正しい例：

GitHub を使用してログインする。

当社の顧客には、GitHub、Foursquare、Microsoft Corporation、Google、Facebook, Inc.が含まれています。

間違った例：

github を使用してログインする。

GITHUB を使用してログインする。

Github を使用してログインする。

gitHub を使用してログインする。

gｲんĤЦ8 を使用してログインする。

当社の顧客には、github、foursquare、microsoft corporation、google、facebook, inc.が含まれています。

当社の顧客には、GITHUB、FOURSQUARE、MICROSOFT CORPORATION、GOOGLE、FACEBOOK, INC.が含まれています。

当社の顧客には、Github、FourSquare、MicroSoft Corporation、Google、FaceBook, Inc.が含まれています。

当社の顧客には、gitHub、fourSquare、microSoft Corporation、google、faceBook, Inc.が含まれています。

当社の顧客には、gｲんĤЦ8、ｷouЯƧquﾑгє、๓เςг๏ร๏Ŧt ς๏гק๏гคtเ๏ภn、900913、ƒ4ᄃëв๏๏к, IПᄃ.が含まれています。

注：ウェブページの全体的なビジュアルスタイルに合わせて、すべて大文字／小文字で表示する必要がある場合は、HTML で標準的な大文字小文字のルールに従って記述し、text-transform: uppercase;／text-transform: lowercase;で表現形式を定義してください。

### 4.2 地道でない略語を使用しない

正しい例：

TypeScript、HTML5 に精通し、少なくとも 1 つのフレームワーク（React、Next.js など）を理解しているフロントエンド開発者が必要です。
間違った例：

Ts、h5 に精通し、少なくとも 1 つのフレームワーク（RJS、nextjs など）を理解している FED が必要です。
